MODEL = "tts_models/el/cv/vits"
SPEAKER = ""

NUMBER_WORDS = {
    0: "μηδέν", 1: "ένα", 2: "δύο", 3: "τρία", 4: "τέσσερα", 5: "πέντε", 6: "έξι", 7: "επτά", 8: "οκτώ", 9: "εννιά",
    10: "δέκα", 11: "έντεκα", 12: "δώδεκα", 13: "δεκατρία", 14: "δεκατέσσερα", 15: "δεκαπέντε", 16: "δεκαέξι",
    17: "δεκαεπτά", 18: "δεκαοκτώ", 19: "δεκαεννιά", 20: "είκοσι", 21: "είκοσι ένα", 22: "είκοσι δύο",
    23: "είκοσι τρία", 24: "είκοσι τέσσερα", 25: "είκοσι πέντε", 26: "είκοσι έξι", 27: "είκοσι επτά",
    28: "είκοσι οκτώ", 29: "είκοσι εννιά", 30: "τριάντα", 31: "τριάντα ένα", 32: "τριάντα δύο",
    33: "τριάντα τρία", 34: "τριάντα τέσσερα", 35: "τριάντα πέντε", 36: "τριάντα έξι", 37: "τριάντα επτά",
    38: "τριάντα οκτώ", 39: "τριάντα εννιά", 40: "σαράντα", 41: "σαράντα ένα", 42: "σαράντα δύο",
    43: "σαράντα τρία", 44: "σαράντα τέσσερα", 45: "σαράντα πέντε", 46: "σαράντα έξι", 47: "σαράντα επτά",
    48: "σαράντα οκτώ", 49: "σαράντα εννιά", 50: "πενήντα", 51: "πενήντα ένα", 52: "πενήντα δύο",
    53: "πενήντα τρία", 54: "πενήντα τέσσερα", 55: "πενήντα πέντε", 56: "πενήντα έξι", 57: "πενήντα επτά",
    58: "πενήντα οκτώ", 59: "πενήντα εννιά", 60: "εξήντα"
}

SENTENCES = {
    "sequence_start": "Στον τρίτο ήχο, η ώρα θα είναι",
    "seconds": "δευτερόλεπτα",
    "precisely": "ακριβώς",
    "oclock": "ακριβώς",
    "and": "και"
}